{
    "hello": "Hello",
    "developer": "Developer",
    "architect": "IT Architect",
    "months": {
        "0": "jan",
        "1": "feb",
        "2": "mar",
        "3": "apr",
        "4": "may",
        "5": "jun",
        "6": "jul",
        "7": "aug",
        "8": "sep",
        "9": "oct",
        "10": "nov",
        "11": "dec"
    },
    "navigation": {
        "home": "Home",
        "about": "About",
        "projects": "Projects",
        "contact": "Contact"
    },
    "home": {
        "title": "IT Architect, Developer & Bugs Hunter",
        "who_am_i_0": "Hey, I'm {{name}}",
        "who_am_i_1": "I'm a freelance web developer and IT architect based in Madrid. I am highly motivated and constantly learning new technologies.",
        "who_am_i_2": "Although I have a lot of experience with back-end technologies, I am also open to front-end and mobile technologies.",
        "who_am_i_3": "Are you looking for an expert for a new project? Do you want to develop and improve an existing project? Or do you just want to hear a third-party opinion?",
        "who_am_i_4": "In any case, I would be happy to work with you. Do not hesitate to contact me. I will get back to you as soon as possible.",
        "my_project": "See my projects"
    },
    "about": {
        "skills": "Skills",
        "backend": "Back-end",
        "frontend": "Front-end & Mobile",
        "database": "Database",
        "wrench": "Other",
        "experience": "Professional experience",
        "formation": "Educacion",
        "present": "present"
    },
    "experiences": {
        "degree": "Spanish Baccalaureat in economics (A-level)",
        "bts": "BTEC Higher National Diploma in development",
        "licence": "Professional degree in development",
        "master": "Master’s degree in development and project management"
    },
    "jobs": {
        "indra": "Developer and Network Assistant (internship)",
        "gocad": "Developer and IT Architect",
        "gigigo": "Senior Back-end Developer",
        "freelance": " IT Architect and Senior Developer"
    },
    "contact": {
        "desc": "Specify your contact details and your message, I will contact you shortly",
        "name": "Name",
        "email": "Email",
        "message": "Message",
        "send": "Send",
        "sending": "Sending...",
        "confirm": "Message sent successfully",
        "reload": "Reload the form",
        "errors": {
            "email": "Please enter a valid email",
            "name": "Please enter a valid name",
            "message": "Please enter your message",
            "message_large": "Your message contains too many characters",
            "other": "An error has occurred"
        }
    },
    "projects": {
        "maindesc": "The projects below are deliberately simplified, it would be too long and complex to detail them.",
        "description": "Description",
        "working": "Mode of operation",
        "remarks": "Notes",
        "technologies": "Technologies",
        "more": "Learn more",
        "dataMutuals": {
            "title": "Data collection for mutual companies",
            "preview": "Websites that allow data collection for multiple mutuals...",
            "description": "Websites that allow data collection for multiple mutuals. These allow mutuals to collect documents for internal operations, such as proof of schooling or annual tax returns. Since the data transferred is sensitive information, users’ data and their documents are encrypted.",
            "steps": [
                "An initial provider sends the client’s data to the application server. These stores the data and creates different user accounts so that they can access the portal through a web browser.",
                "The server instructs a second provider to send an email campaign to the various customers so that they are aware of the process and can connect to the portal.",
                "The aforementioned provider sends the e-mails.",
                "The users post their documents on the portal.",
                "The documents are sent back to the first provider who sends all the files to the different mutual insurance companies at the end of the process."
            ],
            "remarks": [
                "The operations have a limited duration.",
                "There is a reminder/information system for users who are not logged in or who have submitted the wrong documents."
            ]
        },
        "compoService": {
            "title": "PDF documents composition micro-service",
            "preview": "Micro-service for composing PDF documents...",
            "description": "Microservice for compiling PDF documents. This server is based on the Apache FOP library and allows the creation of single or mass PDF documents. This service can be requested from other applications and allows you to create simple documents such as budgets or invoices, but also complete production workflows for projects with printers.",
            "steps": [
                "The client application provides resources that the server stores in order to generate the documents later. These resources include: a template, fonts, images, colour profiles…",
                "The client application requests the server by specifying the template to be used and the various variables needed to create the document.",
                "The server creates the document and sends it back to the client when it is ready."
            ],
            "remarks": [
                "Compositions can be performed synchronously or asynchronously. If a synchronous composition is too slow, it is automatically switched to asynchronous.",
                "In the asynchronous case, the client can retrieve the document either by querying the server or by specifying a callback URL."
            ]
        },
        "welcomePack": {
            "title": "Production of Welcome Packs",
            "preview": "Web project management, production and delivery of Welcome Packs...",
            "description": "Web project management, production and delivery of Welcome Packs. The application allows the client to manage their production, inventory and deliveries of welcome packs. The website is used both by the customer itself and by the vendor who provides the physical service for the production. A welcome pack consists of a personalized letter and card, as well as several variable components.  Each welcome pack has a unique identifier.",
            "steps": [
                "The client transmits the different production orders to the application server. The server registers the different production batches and prepares them.",
                "The server sends a print job to the client, which the client can confirm or reject.",
                "The server requests the composition microservice to create the production flows for making the Welcome Packs.",
                "The microservice sends the various flows back to the server",
                "The server sends the various flows to the service provider. The latter prints the flows, assembles the batches and physically stores them on site and on the website.",
                "The customer sends delivery bills for his various customers. The server prepares the orders.",
                "The server sends the various orders to the vendor who physically ships the specified Welcome Packs.",
                "The vendor sends the shipping information to the server. The server stores the data and enables tracking of the shipments.",
                "The server sends back the shipping information and the identifiers of the welcome packs shipped so that the customer can enter them into their ERP system."
            ],
            "remarks": [
                "The microservice is the one described in the “PDF document composition microservice” project."
            ]
        },
        "promotionTool": {
            "title": "Promotion management",
            "preview": "Application servers that enable customization and creation of promotions operating at REST API...",
            "description": "Application servers that enable customization and creation of promotions operating at REST API. The servers are called either from a front-end application or from mobile applications.",
            "steps": [
                "The client creates a promotion. The server records the data of the new promotion and sends it to external services.",
                "The server sends the promotion to the users through different ways (SMS, email, QR codes…).",
                "The client sends his promotion code to the server. The server logs the customer data and stores various static data.",
                "The server sends the promotion and user data to the client who created the promotion.",
                "The statistics are entered into BigQuery so that the client can view the various statistics in the form of special charts."
            ],
            "remarks": [
                "The architecture of this project is more advanced than the other projects.",
                "There is not only one application server, but two. They communicate their data through a Redis subscriber.",
                "Since this project is so in demand, it also uses Redis to intercept certain results and respond faster."
            ]
        },
        "customERP": {
            "title": "Custom ERP",
            "preview": "Customised “ERP” that allows the management of resources and, above all, the internal management of company files...",
            "description": "Customised “ERP” that allows the management of resources and, above all, the internal management of company files. The application is available via the Internet and accessible through a web browser.",
            "steps": [
                "The company registers its employees in the application. They have the right to create / modify / read profiles of the clients, vendors, folders, projects, orders, requests, invoices, but also to manage schedules and their timesheets. The server is in connection with several service providers, especially in the area of invoicing.",
                "A first service provider (main ERP) sends the data from customers and suppliers. This data is continuously updated and stored in the application; later additional information can be added.",
                "A customer application (another application belonging to the company) sends invoice orders with the details of placed orders. The application creates invoices and stores them.",
                "The server creates physical invoices using a composition service and sends the document to a third-party provider who certifies it.",
                "The provider sends back the certified document. The application prepares to send the invoices by grouping them and adding additional documents depending on the customer in question.",
                "The details of the invoiced items are sent back to the main ERP.",
                "Invoices and their accompanying documents are sent to the third-party service providers to be sent by letter or email.",
                "The service provider reports the status of the shipments updated in the application so that the users can monitor the status of the shipments."
            ],
            "remarks": [
                "The microservice is the one described in the project “PDF documents composition microservice”."
            ]
        }
    }
}
