{
    "hello": "Hola",
    "developer": "Desarollador",
    "architect": "Arquitecto Software",
    "months": {
        "0": "Ene",
        "1": "Feb",
        "2": "Mar",
        "3": "Abr",
        "4": "May",
        "5": "Jun",
        "6": "Jul",
        "7": "Ago",
        "8": "Sep",
        "9": "Oct",
        "10": "Nov",
        "11": "Dic"
    },
    "navigation": {
        "home": "Inicio",
        "about": "A cerca de",
        "projects": "Proyectos",
        "contact": "Contactarme"
    },
    "home": {
        "title": "Arquitecto Software, Desarollador y Cazador de bugs",
        "who_am_i_0": "Hola, soy {{name}}",
        "who_am_i_1": "Soy desarollador web y arquitecto software freelance instalado en Madrid. En progreso permanente, soy un apasionado por las nuevas tecnologías y el aprendizaje constante.",
        "who_am_i_2": "Mis conocimientos se centran principalmente en las tecnologías e infraestructuras de back-end. Sin embargo, estoy abierto a trabajos front-end y mobile.",
        "who_am_i_3": "¿Buscas un experto para diseñar un nuevo proyecto? ¿Quieres evolucionar un proyecto existente? ¿O tal vez solo quieres feedback/asesoramiento externo al proyecto?",
        "who_am_i_4": "¡Seguro que podemos colaborar! No dudes en escribirme, me pondré en contacto contigo lo antes posible.",
        "my_project": "Ver mis proyectos"
    },
    "about": {
        "skills": "Habilidades",
        "backend": "Back-end",
        "frontend": "Front-end y Móvil",
        "database": "Base de datos",
        "wrench": "Otros",
        "experience": "Experiencia profesional",
        "formation": "Educación",
        "present": "ahora"
    },
    "experiences": {
        "degree": "Bachillerato Humanidades y Social",
        "bts": "Grado Técnico Superior DAI",
        "licence": "Licence (Diplomatura en desarrollo informático)",
        "master": "Master I - Responsable de la investigación y el desarrollo del SI"
    },
    "jobs": {
        "indra": "Programador (practicas de fin de grado superior)",
        "gocad": "Arquitecto Software y Desarollador",
        "gigigo": "Desarollador Backend senior",
        "freelance": "Consultante Arquitecto Software y Desarollador Senior"
    },
    "contact": {
        "desc": "Indique sus datos de contacto y su mensaje, en breve me pondré en contacto con usted",
        "name": "Nombre",
        "email": "Email",
        "message": "Mensaje",
        "send": "Enviar",
        "sending": "Enviando...",
        "confirm": "Mensaje enviado con éxito",
        "reload": "Recargar el formulario",
        "errors": {
            "email": "Indica un email valido",
            "name": "Indica un nombre valido",
            "message": "Indica un mensaje valido",
            "message_large": "El mensaje es demasiado largo",
            "other": "Se ha producido un error"
        }
    },
    "projects": {
        "maindesc": "Les projets ci-dessous sont volontairement simplifiés, ce serait trop long et complexe de les détailler.",
        "description": "Descrición",
        "working": "Funcionamiento",
        "remarks": "Observaciones",
        "technologies": "Tecnología",
        "more": "Más información",
        "dataMutuals": {
            "title": "Collecte de données pour mutuelles",
            "preview": "Mini-sites permettant la collecte de données pour diverses mutuelles...",
            "description": "Mini-sites permettant la collecte de données pour diverses mutuelles. Ceux-ci vont permettre aux mutuelles de récupérer des documents pour des opérations internes comme une récupération de justificatifs de scolarités ou des feuilles de déclaration d’imposition annuelles. Les données qui transites étant sensibles toutes les informations utilisateurs ainsi que leurs documents sont encryptées.",
            "steps": [
                "Un premier prestataire va envoyer les données clients au serveur applicatif. Celui-ci va enregistrer les données et créer les différents comptes utilisateurs afin que ceux-ci puissent accéder au portail via un navigateur web.",
                "Le serveur va solliciter un deuxième prestataire afin d’envoyer une campagne email aux différents clients afin que ceux-ci prennent connaissance de l’opération et qu’ils puissent se connecter au portail.",
                "Le prestataire ci-dessus route les emails.",
                "Les utilisateurs fournissent leurs documents sur le portail.",
                "Le document est renvoyé au premier prestataire qui a la fin de l’opération remontera tous les fichiers aux différentes mutuelles."
            ],
            "remarks": [
                "Les opérations ont une durée de vie.",
                "Il existe un système de relance/information pour les utilisateurs qui ne sont pas connectés ou qui ont fournis des documents erronés."
            ]
        },
        "compoService": {
            "title": "Microservice de compositions PDF",
            "preview": "Micro-service de composition de fichiers PDF...",
            "description": "Micro-service de composition de fichiers PDF. Basé sur la librairie Apache FOP ce serveur permet la composition de documents PDF unitaires ou en masse. Ce service est appelable depuis d’autres applications et permet de générer des documents simple comme des devis ou des factures mais aussi des flux de productions complets pour des projets avec des imprimeurs.",
            "steps": [
                "L’application cliente fournie des ressources que le serveur enregistre afin de pouvoir générer les documents plus tard, ces ressources inclus : un model pour définir la mise en page, des polices, des images, des profils de couleurs…",
                "L’application cliente sollicite le serveur en lui indiquant le model à utiliser ainsi que les différentes variables nécessaires pour la génération du document.",
                "Le serveur va générer le document et le renvoyé au client quand la composition sera terminée."
            ],
            "remarks": [
                "Les compositions peuvent se faire de façon synchrone ou asynchrone. Quand une composition synchrone est trop lente celle-ci est rebasculée en asynchrone.",
                "Dans le cas asynchrone le client peut récupérer le document soit en interrogeant le serveur, soit en spécifiant une URL de rappel."
            ]
        },
        "welcomePack": {
            "title": "Production de Welcome Packs",
            "preview": "Projet web de gestion et production de Welcome Pack.",
            "description": "Projet web de gestion et production de Welcome Pack. Le site permet au client de gérer sa production, ses stocks et ses expéditions de Welcome Pack. Le site est utilisé par le client lui-même mais également par le prestataire qui s’occupe de la prestation physique sur la partie production. Un Welcome Pack est composé d’une lettre et une carte personnalisées  ainsi que de plusieurs types de composants variables, chaque Welcome Pack a un identifiant unique.",
            "steps": [
                "Le client transmet les différents ordres de fabrication au serveur applicatif. Le serveur enregistre et prépare les différents lots de productions.",
                "Le serveur renvoi un BAT au client que celui-ci peut valider ou refuser.",
                "Le serveur sollicite un micro-service de composition afin de générer les flux de production pour la fabrication des Welcomes Packs.",
                "Le micro-service renvoi au serveur les différents flux.",
                "Le serveur envoi les différents flux au prestataire. Celui-ci va imprimer les flux, assembler les lots et les mettre en stock physiquement sur site ainsi que sur le site web.",
                "Le client envoi des bons de livraison pour ses différents clients. Le serveur prépare les commandes.",
                "Le serveur envoi les différentes commandes au prestataire qui va expédier physiquement les Welcome Packs spécifiés.",
                "Le prestataire envoi les informations des expédition au serveur. Celui-ci va les enregistrer et permettre de les tracker.",
                "Le serveur renvoi les informations d’expédition ainsi que les identifiants des Welcome Packs expédiés pour que le client puissent les insérés dans son ERP."
            ],
            "remarks": [
                "Le micro-service est celui décrit dans le projet « PDF  Composition Micro-service »."
            ]
        },
        "promotionTool": {
            "title": "Gestion de promotions",
            "preview": "Serveurs applicatifs permettant la customisation et la création de promotions fonctionnant en API REST.",
            "description": "Serveurs applicatifs permettant la customisation et la création de promotions fonctionnant en API REST. Les serveurs sont appelés soit par une application Front-End, soit par des applications mobiles.",
            "steps": [
                "Le client crée une promotion. Le serveur va enregistrer et communiquer aux services extérieurs les données de la nouvelle promotion.",
                "Le serveur va envoyer la promotion aux différents sur divers medias (SMS, Email, Qrcodes…) . ",
                "Le client envoie son code promo aux serveur. Le serveur enregistre les données du client et stocke différentes stats.",
                "Le serveur envoi les données de la promotion et de l’utilisateur au client qui a créé la promotion.",
                "Les statistiques sont déversés dans BigQuery pour que le client puisse consulter les différentes statistiques sous forme de graphiques dédiés."
            ],
            "remarks": [
                "L’architecture de ce projet est plus avancée que les autres projets.",
                "Dans le cas asynchrone le client peut récupérer le document soit en interrogeant le serveur, soit en spécifiant une URL de rappel.",
                "En réalité il n’y a pas qu’un seul serveur applicatif, il y en a deux. Ceux-ci communiquent leurs données via un « subscriber » Redis.",
                "Ce projet étant beaucoup solliciter il utilise également Redis pour catcher certains résultats et répondre plus rapidement."
            ]
        },
        "customERP": {
            "title": "ERP personnalisé",
            "preview": "« ERP » sur mesure permettant donc la gestion de ressources mais surtout la gestion interne des dossiers de l’entreprise.",
            "description": "« ERP » sur mesure permettant donc la gestion de ressources mais surtout la gestion interne des dossiers de l’entreprise. L’applicatition est disponible sur internet et accessible via navigateur web.",
            "steps": [
                "L’entreprise enregistre ses employés sur l’applicatif. Ceux-ci ont le droit de créer / modifier / lire des clients, des fournisseurs, des dossiers, des projets, des commandes, des devis, des factures mais aussi gérer des plannings et leurs feuilles de temps.Le serveur est connecté avec plusieurs prestataires notamment sur la partie facturation.",
                "Un premier prestataire (ERP principal) envoie les données des clients et fournisseurs. Ces données sont mises à jour continuellement, elles sont enregistrées dans l’applicatif, il est ensuite possible de rajouter des informations additionnelles.",
                "Une application cliente (autre applicatif appartenant à l’entreprise) déverse des ordres de facturation avec le détails des commandes passées. L’applicatif crée les factures et les enregistre.",
                "Le serveur génère les factures physiques grâce à un service de composition et envoie le document à un prestataire tiers afin de certifié le document.",
                "Le prestataire renvoi le document certifié. L’applicatif prépare l’envoi des factures en les regroupant et en rajoutant des documents annexes dépendant la situation du client concerné.",
                "Les détails des articles facturés sont renvoyées à l’ERP principal.",
                "Les factures et leurs documents annexes sont envoyés à des prestataires tiers afin d’être envoyés sous format de lettre ou email.",
                "Le prestataire remonte les statuts des envois qui sont actualisés dans l’applicatif afin que les utilisateurs puissent monitorer l’état des envois."
            ],
            "remarks": [
                "Le micro-service est celui décrit dans le projet « PDF  Composition Micro-service »."
            ]
        }
    }
}
