{
    "hello": "Hola",
    "developer": "Desarollador",
    "architect": "Arquitecto Software",
    "months": {
        "0": "Ene",
        "1": "Feb",
        "2": "Mar",
        "3": "Abr",
        "4": "May",
        "5": "Jun",
        "6": "Jul",
        "7": "Ago",
        "8": "Sep",
        "9": "Oct",
        "10": "Nov",
        "11": "Dic"
    },
    "navigation": {
        "home": "Inicio",
        "about": "Acerca de",
        "projects": "Proyectos",
        "contact": "Contactarme"
    },
    "home": {
        "title": "Arquitecto Software, Desarollador y Cazador de bugs",
        "who_am_i_0": "Hola, soy {{name}}",
        "who_am_i_1": "Soy desarrollador web y arquitecto software freelance establecido en Madrid. Soy un apasionado de las nuevas tecnologías y del aprendizaje constante, las mejoras de rendimiento y las perspectivas de desarrollo que aportan a las empresas.",
        "who_am_i_1_1": "Mi experiencia profesional como desarrollador comenzó en 2010 realizando mis primeras prácticas en una empresa. Me doy cuenta rápido que no sé nada y que cometo errores. Después de estas prácticas me cuestiono y empiezo a formarme como autodidacta. A partir de este momento me vuelvo riguroso y por ello cambio mi forma de trabajar que sea solo o en equipo, nunca dejo de querer mejorar y seguir aprendiendo.",
        "who_am_i_1_2": "¡Lección apuntada! De nuestros errores aprendemos!",
        "who_am_i_1_3": "Autónomo y curioso por naturaleza, estoy en permanente vigilancia buscando ese pequeño « algo » que revolucionará mis métodos de trabajo y me hará aún más productivo (gracias Docker :D).  Mi motivación: aportarle la mejor solución, involucrar a sus equipos, comunicar y ayudarlos a progresar.",
        "who_am_i_2": "Mis conocimientos se centran en las tecnologías e infraestructuras de back-end. No obstante, estoy también abierto a trabajos front-end y móvil.",
        "who_am_i_3": "¿Busca a un experto para diseñar un nuevo proyecto? ¿Quiere desarrollar y mejorar un proyecto ya existente? ¿O tal vez solo quiere asesoramiento externo sobre su proyecto?",
        "who_am_i_4": "¡Seguro que podemos colaborar! Contácteme, conversar juntos nos hará mejorar.",
        "my_project": "Ver mis proyectos"
    },
    "about": {
        "skills": "Habilidades",
        "backend": "Back-end",
        "frontend": "Front-end y Móvil",
        "database": "Base de datos",
        "wrench": "Otros",
        "experience": "Experiencia profesional",
        "formation": "Educación",
        "present": "Desde",
        "levels": "Niveles de habilidad",
        "knowledge": "Conocimiento del negocio"
    },
    "experiences": {
        "degree": "Bachillerato Humanidades y Social",
        "bts": "Grado Técnico Superior DAI",
        "licence": "Licence (Diplomatura en desarrollo informático)",
        "master": "Master I - Responsable de la investigación y el desarrollo del SI"
    },
    "jobs": {
        "indra": "Programador (practicas de fin de grado superior)",
        "gocad": "Arquitecto Software y Desarollador",
        "gigigo": "Desarollador Backend senior",
        "freelance": "Consultante Arquitecto Software y Desarollador Senior"
    },
    "knowledges": {
        "company": {
            "title": "Gestión de una empresa de servicios",
            "list": ["Tiempo", "Planning", "Gestión comercial y administración de ventas."]
        },
        "print": {
            "title": "Impresión y enrutamiento",
            "list": [
                "Composición de ficheros (PDF, AFP)",
                "Archivar",
                "Gestión del inventario",
                "Optimización de envolvente"
            ]
        },
        "events": {
            "title": "Eventos",
            "list": ["Gestión de eventos como ferias de vinos"]
        },
        "security": {
            "title": "Seguridad de datos",
            "list": ["GDPR", "Cifrado", "Anonimización"]
        },
        "development": {
            "title": "Desarrollo",
            "list": [
                "Método ágil (Scrum)",
                "Optimizaciones y rendimiento",
                "Geolocalización",
                "Tipografía (TTF, OTF)"
            ]
        }
    },
    "contact": {
        "desc": "Indique sus datos de contacto y su mensaje, en breve me pondré en contacto con usted",
        "name": "Nombre",
        "email": "Email",
        "message": "Mensaje",
        "send": "Enviar",
        "sending": "Enviando...",
        "confirm": "Mensaje enviado con éxito",
        "reload": "Recargar el formulario",
        "errors": {
            "email": "Indica un email valido",
            "name": "Indica un nombre valido",
            "message": "Indica un mensaje valido",
            "message_large": "El mensaje es demasiado largo",
            "other": "Se ha producido un error"
        }
    },
    "projects": {
        "maindesc": "Los ejemplos de proyectos a continuación están deliberadamente simplificados y estoy a su disposición para presentárselos en detalle. No dude en ",
        "description": "Descripción",
        "working": "Funcionamiento",
        "remarks": "Observaciones",
        "technologies": "Tecnología",
        "more": "Más información",
        "dataMutuals": {
            "title": "Recopilación y tratamiento de datos para seguros",
            "preview": "Creación y organización de sitios de gestión de datos transaccionales para varios seguros...",
            "description": "Creación y organización de sitios de gestión de datos transaccionales para varios seguros. Estas permitirán a los seguros recuperar documentos para operaciones internas como la recuperación de comprobantes de escolaridad u hojas de declaración anual de impuestos. Los datos que transitan son sensibles, por lo que toda la información del usuario y sus documentos están encriptados.",
            "steps": [
                "Un primer proveedor envia los datos del cliente al servidor de aplicaciones. Esto guarda los datos y crea las diferentes cuentas de usuario para que puedan acceder al portal a través de un navegador web o móvil.",
                "El servidor solicita a un segundo proveedor para que envíe una campaña de correo electrónico a los distintos clientes para informarles la existencia de la operación y que puedan conectarse al portal.",
                "El proveedor citado anteriormente envía los correos electrónicos.",
                "Los usuarios facilitan sus documentos en el portal.",
                "El documento se devuelve al primer proveedor que, al final de la operación, envia todos los archivos a los distintos seguros."
            ],
            "remarks": [
                "Las operaciones tienen una duración de vida limitada.",
                "El proceso se completa con un sistema de recordatorio/información para los usuarios que no están registrados o que han proporcionado documentos incorrectos."
            ]
        },
        "compoService": {
            "title": "Microservicio de composición de archivos PDF",
            "preview": "Microservicio para generar archivos PDF unitarios o de gran volumen...",
            "description": "Basado en la biblioteca Apache FOP, este servicio se puede solicitar desde otras aplicaciones y permite generar documentos simples como presupuestos o facturas, pero también flujos de producción completos para proyectos con impresoras.",
            "steps": [
                "La aplicación cliente proporciona recursos que el servidor guarda para poder generar los documentos posteriormente. Estos recursos incluyen: un modelo para definir el diseño, fuentes, imágenes, perfiles de color…",
                "La aplicación cliente solicita al servidor indicando el modelo a utilizar, así como las diferentes variables necesarias para la generación del documento.",
                "El servidor genera el documento y lo envia de regreso al cliente cuando se finalice la composición."
            ],
            "remarks": [
                "Las composiciones se pueden realizar de forma síncrona o asíncrona. Cuando una composición síncrona es demasiado lenta, se cambiará automáticamente a asíncrona.",
                "En el caso asíncrono, el cliente puede recuperar el documento consultando al servidor o especificando una URL de callback."
            ]
        },
        "welcomePack": {
            "title": "Producción de Paquetes de Bienvenida",
            "preview": "Proyecto web de gestión, elaboración y entrega de Paquetes de Bienvenida...",
            "description": "Proyecto web de gestión, elaboración y entrega de Paquetes de Bienvenida aplicado al negocio de seguros. La aplicación permite al cliente gestionar su fabricación, inventario y envíos de Paquetes de Bienvenida. Es utilizada por el propio cliente, pero también por el proveedor que se encarga de la producción física. Un Paquete de Bienvenida está compuesto por una carta y una tarjeta personalizadas, así como varios tipos de componentes variables. Cada Paquete de Bienvenida tiene un identificador único.",
            "steps": [
                "El cliente transmite las distintas órdenes de fabricación al servidor de aplicaciones. El servidor registra y prepara los diferentes lotes de producciones.",
                "El servidor devuelve una orden de impresión al cliente que este puede validar o rechazar.",
                "El servidor solicita un microservicio de composición para generar los flujos de producción para la fabricación de los Paquetes de Bienvenida.",
                "El microservicio envía los diferentes flujos de vuelta al servidor.",
                "El servidor envía los diferentes flujos al proveedor. Aquel imprimirá los flujos, ensamblará los lotes y los almacenará físicamente en el almacén y en su página web vía navegador web o móvil.",
                "El cliente envía albaranes de entrega para sus distintos clientes. El servidor prepara los pedidos.",
                "El servidor envía los diversos pedidos al proveedor que enviará físicamente los Paquetes de Bienvenida indicados.",
                "El proveedor transmite la información de los envíos al servidor. El servidor guarda la información y permite que los envíos sean rastreados.",
                "El servidor devuelve la información de envío, así como los identificadores de los Paquetes de Bienvenida enviados para que el cliente los importe en su ERP."
            ],
            "remarks": [
                "El microservicio es aquel descrito en el proyecto “Microservicio de composición de archivos PDF”."
            ]
        },
        "promotionTool": {
            "title": "Gestión de promociones",
            "preview": "Servidores de aplicaciones que permiten la personalización y creación de promociones operando en API REST...",
            "description": "Servidores de aplicaciones que permiten la personalización y creación de promociones operando en API REST. Las APIs están consumidas por una aplicación Front-End o por aplicaciones móviles.",
            "steps": [
                "El cliente crea una promoción. El servidor registra y comunica a servicios externos los datos de la nueva promoción.",
                "El servidor envía la promoción a los usuarios por varios medios (SMS, Email, QRcodes…).",
                "El usuario final envía su código de promoción al servidor. El servidor registra los datos del cliente y almacena varias estadísticas.",
                "El servidor envía la promoción y los datos del usuario al cliente que creó la promoción.",
                "Las estadísticas se vierten en BigQuery para que el cliente pueda consultar las distintas estadísticas en forma de gráficos dedicados."
            ],
            "remarks": [
                "La arquitectura de este proyecto es más avanzada que la de los otros proyectos.",
                "En realidad, no hay un solo servidor de aplicaciones, sino que hay dos. Comunican sus datos a través de un “suscriptor” de Redis.",
                "Dado que este proyecto está muy solicitado, también usa Redis para cachear ciertos resultados y contestar más rápido."
            ]
        },
        "customERP": {
            "title": "Aplicación de gestión denominada “ERP”",
            "preview": "“ERP” a medida que permite la gestión de los recursos, pero sobre todo la gestión interna de los expedientes de la empresa...",
            "description": "“ERP” a medida, colaborativo, que permite la gestión de los recursos, pero sobre todo la gestión interna de los expedientes operacionales de la empresa. La aplicación está disponible en Internet y se puede acceder a ella mediante un navegador web o móvil. Sabe comunicarse con los demás ERPs de las demás filiales existentes.",
            "steps": [
                "La empresa registra a sus empleados en la aplicación. Tienen derecho a crear/modificar/leer los perfiles de los clientes, proveedores, expedientes, proyectos, pedidos, presupuestos, facturas, pero también administrar sus hojas de tiempo. El servidor está conectado con varios proveedores, especialmente en la parte de facturación.",
                "Un primer proveedor (ERP principal) envía los datos de clientes y proveedores. Estos datos se actualizan continuamente, se guardan en la aplicación, posteriormente es posible agregar información adicional.",
                "Una aplicación cliente (otra aplicación perteneciente a la empresa) manda las órdenes de facturación con el detalle de las órdenes realizadas. La aplicación crea facturas y las guarda.",
                "El servidor genera facturas físicas utilizando un servicio de composición y envía el documento a un proveedor externo para certificar el documento.",
                "El proveedor devuelve el documento certificado. La aplicación prepara el envío de facturas agrupándolas y añadiendo documentos adicionales en función de la situación del cliente en cuestión.",
                "Los detalles de los artículos facturados se envían de vuelta al ERP principal.",
                "Las facturas y los documentos que las acompañan se envían a proveedores externos para que se envíen en formato papel (correo postal) o correo electrónico.",
                "El proveedor informa del estado de los envíos que se actualizan en la aplicación para que los usuarios puedan monitorear el estado de los envíos."
            ],
            "remarks": [
                "El microservicio es aquel descrito en el proyecto “Microservicio de composición de archivos PDF”."
            ]
        }
    }
}
